<!DOCTYPE html>
<html>
    <head>
    <meta charset="utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

    <title>
        
            Fu, Wei: eBPF Loader
        
    </title>

    <meta property="og:title" content="eBPF Loader"/>
    <meta property="og:Section" content="website"/>
    <meta property="og:url" content="https://fuweid.com/post/2022-ebpf-loader/"/>
    <meta property="og:image" content="https://fuweid.com/favicon.jpg"/>
    <meta property="og:site_name" content="Fu, Wei"/>
    <meta property="og:description" content="如何加载 eBPF 二进制"/>

    <meta name="twitter:card" content="summary_large_image"></meta>
    <meta name="twitter:title" content="eBPF Loader"></meta>
    <meta name="twitter:site_name" content="Fu, Wei"></meta>
    <meta name="twitter:url" content="https://fuweid.com/post/2022-ebpf-loader/"></meta>
    <meta name="twitter:image" content="https://fuweid.com/favicon.jpg"></meta>
    <meta name="twitter:description" content="如何加载 eBPF 二进制"></meta>
    <meta name="twitter:domain" content="fuweid.com"></meta>

    <link rel="stylesheet" href="/css/fontawesome/all.css" />
    <link rel="stylesheet" href="/css/main.css" /> 
    <link rel="stylesheet" href="/css/normalize.css">
    <link rel="stylesheet" href="/css/prettify.css">
    <link rel="shortcut icon" href="https://fuweid.com/favicon.jpg">
    <link rel="icon" href="https://fuweid.com/favicon.jpg">
    <script type="text/javascript" src="/js/prettify.js"></script>
</head>


    <body onload="doPrettify()">
        <header>
    <nav>
        <ul class="home">
            <li>
                <a href="https://fuweid.com/">Fu, Wei</a>
            </li>
        </ul>
        <ul class="social">
            <li>
                <a class="fab fa-github" href="https://github.com/fuweid" target="_blank"></a>
            </li>
            <li>
                <a class="fab fa-twitter" href="https://twitter.com/fuweid89" target="_blank"></a>
            </li>
            <li>
                <a class="fas fa-rss" href="https://fuweid.com//index.xml" target="_blank"></a>
            </li>
        </ul>
    </nav>
</header>


        <div class="container">
            <article class="single">
                <h1 class="title"> eBPF Loader </h1>
                <h4 class="time"> February 27, 2022 </h4>
                <h2 id="0-what-is-ebpf">0. What is eBPF?</h2>
<p>Extended Berkeley Packet Filter (eBPF) 是由 Linux 提供的内核技术，它是以安全沙盒 (Virtual Machine) 的形式运行用户定义的 ByteCode 来观测内核运行状态以及拓展内核的能力，开发者无需定制内核模块就可以高效地完成对现有模块的拓展。eBPF 安全沙盒是嵌入到 Linux 内核运行态的关键路径上，通过事件订阅的形式来触发 eBPF 程序，其运用场景有：</p>
<ul>
<li><a href="https://github.com/cilium/cilium">cilium</a> 在 L3/L4 提供高效的网络转发能力</li>
<li><a href="https://github.com/iovisor/bcc">bcc</a> 提供常用的观测组件来定位业务遇到的性能问题</li>
<li>Google 内核调度拓展 <a href="https://github.com/google/ghost-userspace">ghOSt</a></li>
</ul>
<p>我过去主要使用 eBPF 在观测和排查一些节点的性能问题。由于底层基础设施能力以及业务运行模型存在差异，这将导致节点组件出现不在预期内的行为，而在本地又难以复现，大大增加了沟通和排查成本。而 eBPF 可以捕捉到程序在内核里的状态，甚至是短命的程序调用 (比如容器领域的 runC 命令) 都可以捕捉, 它可以最大程度地呈现程序的运行状态来提升问题的排查效率。</p>
<p>比如前段时间遇到的 containerD CRI 组件创建容器超时的问题，我通过 <a href="https://github.com/iovisor/bcc">bcc</a> stackcount 捕抓到 <a href="https://github.com/containerd/containerd/pull/6478">根因</a>: umount 可写的文件系统时会调用底层文件系统的刷盘动作，它用来保证数据能及时落盘；但这同时也给磁盘带来压力，IOPS 弱的数据盘将会拖慢 umount 调用。对于一个不熟悉内核代码的开发者来说，eBPF 观测类工具暴露出的关键函数路径就和日志的错误信息一样，全局搜索相应的内核代码段，然后顺藤摸瓜，总会找到些蛛丝马迹。</p>
<p>eBPF 目前发展的比较快，其中一个重要的支线是 Compile-Once Run-Everwhere (CO-RE) ，这有点像 <a href="https://github.com/moby/moby">docker</a> 镜像分发的 Build-Once Run-Anywhere, 下面将主要围绕兼容性去介绍如何加载 eBPF 程序。</p>
<h3 id="1-type-metadata">1. Type Metadata</h3>
<p>eBPF 允许读取和修改内核运行态的数据，常见数据结构有线程的 <code>task_struct</code> 和网络子系统的 <code>__sk_buff</code>。这些常用的结构体在不同内核版本之间存在差异， 比如某一个字段位于 <code>task_struct</code> 结构体的第 16 字节处，然而升级到某一个内核版本后，这个字段被移到第 24 字节处，那么原先编译好的 eBPF 将无法正常工作。早期的 <a href="https://github.com/iovisor/bcc">bcc</a> 组件在使用过程中都是在目标节点上利用现有的内核相关头文件来编译。但即使如此，bcc 也没法解决字段名被更换的问题，字段名变化容易出现编译不通过。因此早期大部分情况下，开发者还是会选择根据不同内核版本出不同的二进制，这给测试验证带来了极大的成本。</p>
<p>为了解决类型匹配问题，eBPF 需要额外的类型系统的描述数据。eBPF 程序所使用的数据类型和函数接口都通过常用的调试信息 <a href="https://dwarfstd.org/doc/Debugging%20using%20DWARF-2012.pdf">DWARF</a> 描述, 如下图所示 <a href="https://github.com/libbpf/libbpf-bootstrap/blob/master/examples/c/bootstrap.bpf.c">bootstrap.bpf.c</a> 编译完毕后的 <code>task_struct</code> 部分类型信息， 其中 <code>thread_info</code> 和 <code>state</code> 是 <code>task_struct</code>的字段。</p>
<div class="highlight"><pre class="chroma"><code class="language-text" data-lang="text">// use llvm-dwarfdump
...

0x00005f27:   DW_TAG_structure_type
                DW_AT_name      (&#34;task_struct&#34;)
                DW_AT_byte_size (0x1ac0)
                DW_AT_decl_file (&#34;xxx&#34;)
                DW_AT_decl_line (883)

0x00005f2f:     DW_TAG_member
                  DW_AT_name    (&#34;thread_info&#34;)
                  DW_AT_type    (0x00006775 &#34;thread_info&#34;)
                  DW_AT_decl_file       (&#34;xxx&#34;)
                  DW_AT_decl_line       (884)
                  DW_AT_data_member_location    (0x00)

0x00005f3a:     DW_TAG_member
                  DW_AT_name    (&#34;state&#34;)
                  DW_AT_type    (0x00006793 &#34;volatile long&#34;)
                  DW_AT_decl_file       (&#34;xxx&#34;)
                  DW_AT_decl_line       (885)
                  DW_AT_data_member_location    (0x10)

...
</code></pre></div><p>DWARF 对类型描述十分详细，包含类型字段的大小、字段的偏移量等等。当 eBPF 加载时，只需要在当前 Linux 内核的 DWARF 调试信息找到最匹配 eBPF 程序中的类型即可，即使字段的偏移量发生改变也没关系，只需 Relocation 成对应的偏移量即可。但 DWARF 调试信息为纯文本格式，内核的调试信息大概有 100+ MB，让内核启动带上这些信息成本太高了，这里需要可压缩的类型格式。</p>
<p>内核社区提出了 <a href="https://www.kernel.org/doc/html/v5.13/bpf/btf.html">BPF Type Format (BTF)</a>, 它可以将 100+ MB DWARF 信息压缩到 1.5 MB，eBPF 以及 Linux 内核都方便携带，具体的压缩算法可以阅读 <a href="https://nakryiko.com/posts/btf-dedup/">BTF deduplication and Linux kernel BTF</a>, 在此就仅仅展示 BTF dump 信息。</p>
<div class="highlight"><pre class="chroma"><code class="language-text" data-lang="text">// use pahole -JV
...

[624] STRUCT task_struct size=6848
        thread_info type_id=625 bits_offset=0
        state type_id=626 bits_offset=128
        stack type_id=29 bits_offset=192
        usage type_id=308 bits_offset=256
        flags type_id=37 bits_offset=288
        ptrace type_id=37 bits_offset=320
        on_cpu type_id=10 bits_offset=352
        wake_entry type_id=628 bits_offset=384
        cpu type_id=37 bits_offset=512
...

</code></pre></div><p>当每个字段的偏移量以及类型信息可通过极低的成本携带时，eBPF 加载器可以使用类型匹配策略来将使用体验提升到新的高度。下面将介绍加载器的核心工作 - 重定向。</p>
<h3 id="2-relocation">2. Relocation</h3>
<p>eBPF 一般来说是由 clang/llvm 编译 C 文件得到的 ELF 二进制文件， 其中它采用十个通用的寄存器、只读的 Frame Pointer 寄存器以及使用长度为 64 bits 的 <a href="https://www.kernel.org/doc/html/latest/bpf/instruction-set.html">指令集</a>。加载器需要解决重定向后才能进行 BPF Verifier，而重定向内容主要涉及到三部分 Map，CO-RE 以及函数调用。</p>
<h4 id="21-map">2.1 Map</h4>
<p>eBPF 程序和程序之间以及同用户态之间的交互都是通过 Map 来实现，而 Map 增删改查是通过文件句柄的形式来操作，而这依赖 <a href="https://man7.org/linux/man-pages/man2/bpf.2.html">BPF_MAP_CREATE</a> bpf 系统调用。</p>
<div class="highlight"><pre class="chroma"><code class="language-c" data-lang="c"><span class="c1">// https://man7.org/linux/man-pages/man2/bpf.2.html
</span><span class="c1"></span>
<span class="n">bpf</span><span class="p">(</span><span class="n">BPF_MAP_CREATE</span><span class="p">,</span> <span class="o">&amp;</span><span class="n">bpf_attr</span><span class="p">,</span> <span class="k">sizeof</span><span class="p">(</span><span class="n">bpf_attr</span><span class="p">));</span>

<span class="k">union</span> <span class="n">bpf_attr</span> <span class="p">{</span>
  <span class="k">struct</span> <span class="p">{</span> <span class="cm">/* anonymous struct used by BPF_MAP_CREATE command */</span>
      <span class="n">__u32</span>   <span class="n">map_type</span><span class="p">;</span>       <span class="cm">/* one of enum bpf_map_type */</span>
      <span class="n">__u32</span>   <span class="n">key_size</span><span class="p">;</span>       <span class="cm">/* size of key in bytes */</span>
      <span class="n">__u32</span>   <span class="n">value_size</span><span class="p">;</span>     <span class="cm">/* size of value in bytes */</span>
      <span class="n">__u32</span>   <span class="n">max_entries</span><span class="p">;</span>    <span class="cm">/* max number of entries in a map */</span>
      <span class="n">__u32</span>   <span class="n">map_flags</span><span class="p">;</span>      <span class="cm">/* prealloc or not */</span>
  <span class="p">};</span>
<span class="p">}</span>
</code></pre></div><p><code>bpf_attr</code> 定义可以从 ELF 二进制的 section <code>.maps</code> 或者 <code>maps</code> 中获取， 如下面的代码片段所示。<code>bpf_map_def</code> 定义数据模式已经被弃用了，如下图所示，加载器需要严格按照固定的偏移量来读取 <code>bpf_attr</code>，相比 BTF 类型系统而言，编码和使用体验都差很多。</p>
<div class="highlight"><pre class="chroma"><code class="language-c" data-lang="c"><span class="c1">// Use BTF
</span><span class="c1"></span><span class="k">struct</span> <span class="p">{</span>
	<span class="n">__uint</span><span class="p">(</span><span class="n">type</span><span class="p">,</span> <span class="n">BPF_MAP_TYPE_HASH</span><span class="p">);</span>
	<span class="n">__uint</span><span class="p">(</span><span class="n">max_entries</span><span class="p">,</span> <span class="mi">8192</span><span class="p">);</span>
	<span class="n">__type</span><span class="p">(</span><span class="n">key</span><span class="p">,</span> <span class="n">pid_t</span><span class="p">);</span>
	<span class="n">__type</span><span class="p">(</span><span class="n">value</span><span class="p">,</span> <span class="n">u64</span><span class="p">);</span>
<span class="p">}</span> <span class="n">exec_start_btf</span> <span class="n">SEC</span><span class="p">(</span><span class="s">&#34;.maps&#34;</span><span class="p">);</span>

<span class="c1">// Use symbol but it has been deprecated
</span><span class="c1"></span><span class="k">struct</span> <span class="n">bpf_map_def</span> <span class="nf">SEC</span><span class="p">(</span><span class="s">&#34;maps&#34;</span><span class="p">)</span> <span class="n">exec_start_symbol</span> <span class="o">=</span> <span class="p">{</span>
	<span class="p">.</span><span class="n">type</span>        <span class="o">=</span> <span class="n">BPF_MAP_TYPE_HASH</span><span class="p">,</span>
