<rss version="2.0" xmlns:atom="http://www.w3.org/2005/Atom">
    <channel>
        <title>FuWei</title>
        <link>https://fuweid.com/</link>
        <copyright>2022 Wei Fu</copyright>
        <lastBuildDate>Sat, 15 Oct 2022 18:20:45 +0800</lastBuildDate>
        <atom:link href="/" rel="self" type="application/rss+xml" />

        
        <item>
          <title>使用 unshare(CLONE_FS) 来优化 OverlayFS 挂载</title>
          <link>/post/2022-go-unshare-clonefs/</link>
          <pubDate>Sat, 15 Oct 2022 18:20:45 +0800</pubDate>
          <guid>https://fuweid.com/post/2022-go-unshare-clonefs/</guid>
          <description>&lt;h3 id=&#34;背景&#34;&gt;背景&lt;/h3&gt;
&lt;p&gt;在 Linux 平台上，大部分情况下会使用 &lt;a href=&#34;https://docs.kernel.org/filesystems/overlayfs.html&#34;&gt;OverlayFS&lt;/a&gt; 文件系统来管理容器镜像存储，而 OverlayFS 文件的特点也比较符合容器场景使用：它不仅可以将多个目录合并成统一的访问视图，还能做到读写分离。&lt;/p&gt;
&lt;div class=&#34;highlight&#34;&gt;&lt;pre class=&#34;chroma&#34;&gt;&lt;code class=&#34;language-bash&#34; data-lang=&#34;bash&#34;&gt;mount -t overlay overlay &lt;span class=&#34;se&#34;&gt;\
&lt;/span&gt;&lt;span class=&#34;se&#34;&gt;&lt;/span&gt;  -olowerdir&lt;span class=&#34;o&#34;&gt;=&lt;/span&gt;/lower1:/lower2:/lower3,upperdir&lt;span class=&#34;o&#34;&gt;=&lt;/span&gt;/upper,workdir&lt;span class=&#34;o&#34;&gt;=&lt;/span&gt;/work &lt;span class=&#34;se&#34;&gt;\
&lt;/span&gt;&lt;span class=&#34;se&#34;&gt;&lt;/span&gt;  /merged

&lt;p&gt;&lt;img src=&#34;https://fuweid.com/img/2022-ebpf-portable-with-btfhub/p6-customize-btf-path.svg&#34; alt=&#34;customize-btf-path&#34;&gt;&lt;/p&gt;
&lt;p&gt;这个方案解决了低内核版本不支持导出 BTF 的问题。虽然每一个内核版本 BTF 信息不大，但也抗不住小版本的迭代，就目前 BTF-Hub 提供 ubuntu 发行版的可用 BTF 信息就有 200 MB。在演讲者看来它和 falco 驱动的多内核版本构建差别不大，会场主持人也开玩笑说：&amp;ldquo;如果 github 挂了，我们就获取不到 BTF 数据了&amp;rdquo;。演讲者提出了比较有意思的想法: Embedded BTF。&lt;/p&gt;
&lt;p&gt;Embeded BTF 核心设计就是去除无用的 BTF 信息。举个例子， bcc 提供了 libbpf-tools 38 个 eBPF 程序，但这些程序使用的内核数据结构只是内核 BTF 信息的子集，只要能获取出这个子集就能降低携带 BTF 信息成本，这个提取的方案叫做 &lt;a href=&#34;https://lore.kernel.org/bpf/20220215225856.671072-1-mauricio@kinvolk.io/&#34;&gt;BTFGen&lt;/a&gt;，已经被 Linux bpf-next 所接受了。下面可以看下我本地使用的效果：&lt;/p&gt;
&lt;p&gt;&lt;img src=&#34;https://fuweid.com/img/2022-ebpf-portable-with-btfhub/p7-min-core-gen.svg&#34; alt=&#34;min-core-gen&#34;&gt;&lt;/p&gt;
&lt;p&gt;&lt;code&gt;4.9MB&lt;/code&gt; 里只有 &lt;code&gt;3.3KB&lt;/code&gt; 数据有用，对于一类 eBPF 程序而言，即使把尽可能多内核版本的 BTF 随身携带也不会带来存储空间压力；当线上内核版本较为统一时，开发者甚至还可以将 BTF 信息放入到容器镜像或者应用程序的二进制里。&lt;/p&gt;
&lt;p&gt;对我而言，这个方案的确是让低版本的内核享受到 CO-RE 的好处，&lt;a href=&#34;https://github.com/iovisor/bcc/pull/3889&#34;&gt;甚至会改变 bcc 工具包的发布方式&lt;/a&gt;。&lt;/p&gt;
&lt;h2 id=&#34;3-summary&#34;&gt;3. Summary&lt;/h2&gt;
&lt;p&gt;除了 BTF-Hub 和 Embedded BTF 之外，演讲者还介绍了很多他们遇到的 CO-RE 挑战，实战编程中还是有一定的参考意义，值得一看。&lt;/p&gt;
</description>
        </item>
        
        <item>
          <title>eBPF Loader</title>
          <link>/post/2022-ebpf-loader/</link>
          <pubDate>Sun, 27 Feb 2022 23:00:53 +0800</pubDate>
          <guid>https://fuweid.com/post/2022-ebpf-loader/</guid>
          <description>&lt;h2 id=&#34;0-what-is-ebpf&#34;&gt;0. What is eBPF?&lt;/h2&gt;
&lt;p&gt;Extended Berkeley Packet Filter (eBPF) 是由 Linux 提供的内核技术，它是以安全沙盒 (Virtual Machine) 的形式运行用户定义的 ByteCode 来观测内核运行状态以及拓展内核的能力，开发者无需定制内核模块就可以高效地完成对现有模块的拓展。eBPF 安全沙盒是嵌入到 Linux 内核运行态的关键路径上，通过事件订阅的形式来触发 eBPF 程序，其运用场景有：&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;a href=&#34;https://github.com/cilium/cilium&#34;&gt;cilium&lt;/a&gt; 在 L3/L4 提供高效的网络转发能力&lt;/li&gt;
&lt;li&gt;&lt;a href=&#34;https://github.com/iovisor/bcc&#34;&gt;bcc&lt;/a&gt; 提供常用的观测组件来定位业务遇到的性能问题&lt;/li&gt;
&lt;li&gt;Google 内核调度拓展 &lt;a href=&#34;https://github.com/google/ghost-userspace&#34;&gt;ghOSt&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;我过去主要使用 eBPF 在观测和排查一些节点的性能问题。由于底层基础设施能力以及业务运行模型存在差异，这将导致节点组件出现不在预期内的行为，而在本地又难以复现，大大增加了沟通和排查成本。而 eBPF 可以捕捉到程序在内核里的状态，甚至是短命的程序调用 (比如容器领域的 runC 命令) 都可以捕捉, 它可以最大程度地呈现程序的运行状态来提升问题的排查效率。&lt;/p&gt;
&lt;p&gt;比如前段时间遇到的 containerD CRI 组件创建容器超时的问题，我通过 &lt;a href=&#34;https://github.com/iovisor/bcc&#34;&gt;bcc&lt;/a&gt; stackcount 捕抓到 &lt;a href=&#34;https://github.com/containerd/containerd/pull/6478&#34;&gt;根因&lt;/a&gt;: umount 可写的文件系统时会调用底层文件系统的刷盘动作，它用来保证数据能及时落盘；但这同时也给磁盘带来压力，IOPS 弱的数据盘将会拖慢 umount 调用。对于一个不熟悉内核代码的开发者来说，eBPF 观测类工具暴露出的关键函数路径就和日志的错误信息一样，全局搜索相应的内核代码段，然后顺藤摸瓜，总会找到些蛛丝马迹。&lt;/p&gt;
&lt;p&gt;eBPF 目前发展的比较快，其中一个重要的支线是 Compile-Once Run-Everwhere (CO-RE) ，这有点像 &lt;a href=&#34;https://github.com/moby/moby&#34;&gt;docker&lt;/a&gt; 镜像分发的 Build-Once Run-Anywhere, 下面将主要围绕兼容性去介绍如何加载 eBPF 程序。&lt;/p&gt;
&lt;h3 id=&#34;1-type-metadata&#34;&gt;1. Type Metadata&lt;/h3&gt;
&lt;p&gt;eBPF 允许读取和修改内核运行态的数据，常见数据结构有线程的 &lt;code&gt;task_struct&lt;/code&gt; 和网络子系统的 &lt;code&gt;__sk_buff&lt;/code&gt;。这些常用的结构体在不同内核版本之间存在差异， 比如某一个字段位于 &lt;code&gt;task_struct&lt;/code&gt; 结构体的第 16 字节处，然而升级到某一个内核版本后，这个字段被移到第 24 字节处，那么原先编译好的 eBPF 将无法正常工作。早期的 &lt;a href=&#34;https://github.com/iovisor/bcc&#34;&gt;bcc&lt;/a&gt; 组件在使用过程中都是在目标节点上利用现有的内核相关头文件来编译。但即使如此，bcc 也没法解决字段名被更换的问题，字段名变化容易出现编译不通过。因此早期大部分情况下，开发者还是会选择根据不同内核版本出不同的二进制，这给测试验证带来了极大的成本。&lt;/p&gt;
&lt;p&gt;为了解决类型匹配问题，eBPF 需要额外的类型系统的描述数据。eBPF 程序所使用的数据类型和函数接口都通过常用的调试信息 &lt;a href=&#34;https://dwarfstd.org/doc/Debugging%20using%20DWARF-2012.pdf&#34;&gt;DWARF&lt;/a&gt; 描述, 如下图所示 &lt;a href=&#34;https://github.com/libbpf/libbpf-bootstrap/blob/master/examples/c/bootstrap.bpf.c&#34;&gt;bootstrap.bpf.c&lt;/a&gt; 编译完毕后的 &lt;code&gt;task_struct&lt;/code&gt; 部分类型信息， 其中 &lt;code&gt;thread_info&lt;/code&gt; 和 &lt;code&gt;state&lt;/code&gt; 是 &lt;code&gt;task_struct&lt;/code&gt;的字段。&lt;/p&gt;
&lt;div class=&#34;highlight&#34;&gt;&lt;pre class=&#34;chroma&#34;&gt;&lt;code class=&#34;language-text&#34; data-lang=&#34;text&#34;&gt;// use llvm-dwarfdump
...

0x00005f27:   DW_TAG_structure_type
                DW_AT_name      (&amp;#34;task_struct&amp;#34;)
                DW_AT_byte_size (0x1ac0)
                DW_AT_decl_file (&amp;#34;xxx&amp;#34;)
                DW_AT_decl_line (883)

0x00005f2f:     DW_TAG_member
                  DW_AT_name    (&amp;#34;thread_info&amp;#34;)
                  DW_AT_type    (0x00006775 &amp;#34;thread_info&amp;#34;)
                  DW_AT_decl_file       (&amp;#34;xxx&amp;#34;)
                  DW_AT_decl_line       (884)
                  DW_AT_data_member_location    (0x00)

0x00005f3a:     DW_TAG_member
                  DW_AT_name    (&amp;#34;state&amp;#34;)
                  DW_AT_type    (0x00006793 &amp;#34;volatile long&amp;#34;)
                  DW_AT_decl_file       (&amp;#34;xxx&amp;#34;)
                  DW_AT_decl_line       (885)
                  DW_AT_data_member_location    (0x10)

...
&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;p&gt;DWARF 对类型描述十分详细，包含类型字段的大小、字段的偏移量等等。当 eBPF 加载时，只需要在当前 Linux 内核的 DWARF 调试信息找到最匹配 eBPF 程序中的类型即可，即使字段的偏移量发生改变也没关系，只需 Relocation 成对应的偏移量即可。但 DWARF 调试信息为纯文本格式，内核的调试信息大概有 100+ MB，让内核启动带上这些信息成本太高了，这里需要可压缩的类型格式。&lt;/p&gt;
&lt;p&gt;内核社区提出了 &lt;a href=&#34;https://www.kernel.org/doc/html/v5.13/bpf/btf.html&#34;&gt;BPF Type Format (BTF)&lt;/a&gt;, 它可以将 100+ MB DWARF 信息压缩到 1.5 MB，eBPF 以及 Linux 内核都方便携带，具体的压缩算法可以阅读 &lt;a href=&#34;https://nakryiko.com/posts/btf-dedup/&#34;&gt;BTF deduplication and Linux kernel BTF&lt;/a&gt;, 在此就仅仅展示 BTF dump 信息。&lt;/p&gt;
&lt;div class=&#34;highlight&#34;&gt;&lt;pre class=&#34;chroma&#34;&gt;&lt;code class=&#34;language-text&#34; data-lang=&#34;text&#34;&gt;// use pahole -JV
...

[624] STRUCT task_struct size=6848
        thread_info type_id=625 bits_offset=0
        state type_id=626 bits_offset=128
        stack type_id=29 bits_offset=192
        usage type_id=308 bits_offset=256
        flags type_id=37 bits_offset=288
        ptrace type_id=37 bits_offset=320
        on_cpu type_id=10 bits_offset=352
        wake_entry type_id=628 bits_offset=384
        cpu type_id=37 bits_offset=512
...

&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;p&gt;当每个字段的偏移量以及类型信息可通过极低的成本携带时，eBPF 加载器可以使用类型匹配策略来将使用体验提升到新的高度。下面将介绍加载器的核心工作 - 重定向。&lt;/p&gt;
&lt;h3 id=&#34;2-relocation&#34;&gt;2. Relocation&lt;/h3&gt;
&lt;p&gt;eBPF 一般来说是由 clang/llvm 编译 C 文件得到的 ELF 二进制文件， 其中它采用十个通用的寄存器、只读的 Frame Pointer 寄存器以及使用长度为 64 bits 的 &lt;a href=&#34;https://www.kernel.org/doc/html/latest/bpf/instruction-set.html&#34;&gt;指令集&lt;/a&gt;。加载器需要解决重定向后才能进行 BPF Verifier，而重定向内容主要涉及到三部分 Map，CO-RE 以及函数调用。&lt;/p&gt;
&lt;h4 id=&#34;21-map&#34;&gt;2.1 Map&lt;/h4&gt;
&lt;p&gt;eBPF 程序和程序之间以及同用户态之间的交互都是通过 Map 来实现，而 Map 增删改查是通过文件句柄的形式来操作，而这依赖 &lt;a href=&#34;https://man7.org/linux/man-pages/man2/bpf.2.html&#34;&gt;BPF_MAP_CREATE&lt;/a&gt; bpf 系统调用。&lt;/p&gt;
&lt;div class=&#34;highlight&#34;&gt;&lt;pre class=&#34;chroma&#34;&gt;&lt;code class=&#34;language-c&#34; data-lang=&#34;c&#34;&gt;&lt;span class=&#34;c1&#34;&gt;// https://man7.org/linux/man-pages/man2/bpf.2.html
&lt;/span&gt;&lt;span class=&#34;c1&#34;&gt;&lt;/span&gt;
&lt;span class=&#34;n&#34;&gt;bpf&lt;/span&gt;&lt;span class=&#34;p&#34;&gt;(&lt;/span&gt;&lt;span class=&#34;n&#34;&gt;BPF_MAP_CREATE&lt;/span&gt;&lt;span class=&#34;p&#34;&gt;,&lt;/span&gt; &lt;span class=&#34;o&#34;&gt;&amp;amp;&lt;/span&gt;&lt;span class=&#34;n&#34;&gt;bpf_attr&lt;/span&gt;&lt;span class=&#34;p&#34;&gt;,&lt;/span&gt; &lt;span class=&#34;k&#34;&gt;sizeof&lt;/span&gt;&lt;span class=&#34;p&#34;&gt;(&lt;/span&gt;&lt;span class=&#34;n&#34;&gt;bpf_attr&lt;/span&gt;&lt;span class=&#34;p&#34;&gt;));&lt;/span&gt;

&lt;span class=&#34;k&#34;&gt;union&lt;/span&gt; &lt;span class=&#34;n&#34;&gt;bpf_attr&lt;/span&gt; &lt;span class=&#34;p&#34;&gt;{&lt;/span&gt;
  &lt;span class=&#34;k&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;p&#34;&gt;{&lt;/span&gt; &lt;span class=&#34;cm&#34;&gt;/* anonymous struct used by BPF_MAP_CREATE command */&lt;/span&gt;
      &lt;span class=&#34;n&#34;&gt;__u32&lt;/span&gt;   &lt;span class=&#34;n&#34;&gt;map_type&lt;/span&gt;&lt;span class=&#34;p&#34;&gt;;&lt;/span&gt;       &lt;span class=&#34;cm&#34;&gt;/* one of enum bpf_map_type */&lt;/span&gt;
      &lt;span class=&#34;n&#34;&gt;__u32&lt;/span&gt;   &lt;span class=&#34;n&#34;&gt;key_size&lt;/span&gt;&lt;span class=&#34;p&#34;&gt;;&lt;/span&gt;       &lt;span class=&#34;cm&#34;&gt;/* size of key in bytes */&lt;/span&gt;
      &lt;span class=&#34;n&#34;&gt;__u32&lt;/span&gt;   &lt;span class=&#34;n&#34;&gt;value_size&lt;/span&gt;&lt;span class=&#34;p&#34;&gt;;&lt;/span&gt;     &lt;span class=&#34;cm&#34;&gt;/* size of value in bytes */&lt;/span&gt;
      &lt;span class=&#34;n&#34;&gt;__u32&lt;/span&gt;   &lt;span class=&#34;n&#34;&gt;max_entries&lt;/span&gt;&lt;span class=&#34;p&#34;&gt;;&lt;/span&gt;    &lt;span class=&#34;cm&#34;&gt;/* max number of entries in a map */&lt;/span&gt;
      &lt;span class=&#34;n&#34;&gt;__u32&lt;/span&gt;   &lt;span class=&#34;n&#34;&gt;map_flags&lt;/span&gt;&lt;span class=&#34;p&#34;&gt;;&lt;/span&gt;      &lt;span class=&#34;cm&#34;&gt;/* prealloc or not */&lt;/span&gt;
  &lt;span class=&#34;p&#34;&gt;};&lt;/span&gt;
&lt;span class=&#34;p&#34;&gt;}&lt;/span&gt;
&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;p&gt;&lt;code&gt;bpf_attr&lt;/code&gt; 定义可以从 ELF 二进制的 section &lt;code&gt;.maps&lt;/code&gt; 或者 &lt;code&gt;maps&lt;/code&gt; 中获取， 如下面的代码片段所示。&lt;code&gt;bpf_map_def&lt;/code&gt; 定义数据模式已经被弃用了，如下图所示，加载器需要严格按照固定的偏移量来读取 &lt;code&gt;bpf_attr&lt;/code&gt;，相比 BTF 类型系统而言，编码和使用体验都差很多。&lt;/p&gt;
&lt;div class=&#34;highlight&#34;&gt;&lt;pre class=&#34;chroma&#34;&gt;&lt;code class=&#34;language-c&#34; data-lang=&#34;c&#34;&gt;&lt;span class=&#34;c1&#34;&gt;// Use BTF
&lt;/span&gt;&lt;span class=&#34;c1&#34;&gt;&lt;/span&gt;&lt;span class=&#34;k&#34;&gt;struct&lt;/span&gt; &lt;span class=&#34;p&#34;&gt;{&lt;/span&gt;
